app/views/documentos/_form.html.erb

SELECT `tipo_documentos`.* FROM `tipo_documentos`
---
            <div class="controls">
              <%= f.collection_select(:tipo_documento_id, TipoDocumento.all, :id, :nombre) %>