app/views/documentos/index.html.erb

SELECT `documentos`.* FROM `documentos`
---
    <td>
      <% if documento.documento_anexo.count > 0 then %>