app/controllers/documentos_controller.rb

  def index
    @documentos = Documento.all
---
SELECT `documentos`.* FROM `documentos`

  def show
    @documento = Documento.find(params[:id])
---
SELECT `documentos`.* FROM `documentos` WHERE `documentos`.`id` = 1 LIMIT 1

  def create
    @documento = Documento.new(params[:documento])

    respond_to do |format|
      if @documento.save
---
INSERT INTO `documentos` (`anio`, `asunto`, `autorizado`, `created_at`, `destinatario`, `fecha_documento`, `fecha_recepcion`, `fecha_salida`, `iniciado_por`, `localidad_id`, `motivo`, `nombres_y_apellidos`, `nro_documento`, `nro_salida`, `observacion`, `procedencia`, `se_encuentra_en`, `sigla`, `tipo_documento_id`, `updated_at`) VALUES (NULL, '', 0, '2014-03-20 06:57:09', '', '2014-03-20', '2014-03-20', '2014-03-20', '', NULL, '', '', '', '', '', '', '', '', NULL, '2014-03-20 06:57:09')